cf/Enums/ContactInformationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>ContactInformationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Address</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Phone</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EmailAddress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebPage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fax</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/EventTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>EventTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>PhoneCall</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PrivateMeeting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Event.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Event</Name>
			<BasedOn>
				<xr:Item>Document.Event</xr:Item>
				<xr:Item>Document.WorkOrder</xr:Item>
				<xr:Item>Document.CustomerOrder</xr:Item>
				<xr:Item>Document.PurchaseOrder</xr:Item>
				<xr:Item>Document.SupplierInvoice</xr:Item>
				<xr:Item>Document.CustomerInvoice</xr:Item>
				<xr:Item>Document.InvoiceForPayment</xr:Item>
				<xr:Item>Document.PaymentExpense</xr:Item>
				<xr:Item>Document.CashPayment</xr:Item>
				<xr:Item>Document.PaymentOrder</xr:Item>
				<xr:Item>Document.PaymentReceipt</xr:Item>
				<xr:Item>Document.CashReceipt</xr:Item>
				<xr:Item>Document.AgentReport</xr:Item>
				<xr:Item>Document.ReportToPrincipal</xr:Item>
				<xr:Item>Document.ProcessingReport</xr:Item>
				<xr:Item>Document.SubcontractorReport</xr:Item>
				<xr:Item>Document.AcceptanceCertificate</xr:Item>
				<xr:Item>Catalog.Counterparties</xr:Item>
				<xr:Item>Catalog.ContactPersons</xr:Item>
				<xr:Item>Document.SupplierInvoiceForPayment</xr:Item>
				<xr:Item>Document.SettlementsReconciliation</xr:Item>
				<xr:Item>Document.ProductionOrder</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EventType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EventTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EventStates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomingOutgoingEvent</Name>
					<Type>
						<v8:Type>cfg:EnumRef.IncomingOutgoingEvent</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.EventsSubjects</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ImagesHTML</Name>
					<Comment>The structure of pictures of the formatted document</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BasisDocument</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
						<v8:Type>cfg:DocumentRef.SettlementsReconciliation</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
						<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoiceForPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.Event</v8:Type>
						<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
						<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
						<v8:Type>cfg:DocumentRef.BulkMail</v8:Type>
						<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EventBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EventEnding</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParticipantsList</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSSenderName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>BasisDocuments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>BasisDocument</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SettlementsReconciliation</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.WorkOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.InvoiceForPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.Event</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
								<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.BulkMail</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoiceForPayment</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Participants</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contact</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HowToContact</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NumberForSending</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MessageID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeliveryStatus</Name>
							<Type>
								<v8:Type>cfg:EnumRef.SMSMessageStates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/CommonModules/ContactInformationSBClient/Ext/Module.bsl
#Region FormItemsEventHadlers

Procedure ActionCIClick(Form, Item) Export
	
	IndexCI = Number(Mid(Item.Name, StrLen("ActionCI_")+1));
	DataCI = Form.ContactInformation[IndexCI];
	
	If DataCI.Type = PredefinedValue("Enum.ContactInformationTypes.Skype") Then
		
		Parameters = New Structure("LoginSkype");
		Parameters.LoginSkype = DataCI.Presentation;
		List = New ValueList;
		List.Add("Call", NStr("ru = 'Позвонить'; en = 'Call'"));
		List.Add("StartChat", NStr("ru = 'Начать чат'; en = 'Start chat'"));
		NotifyDescription = New NotifyDescription("AfterSelectionFromMenuSkype", ThisObject, Parameters);
		Form.ShowChooseFromMenu(NotifyDescription, List, Item);
		Return;
		
	EndIf;
	
	FillBasis = New Structure("Contact", Form.Object.Ref);
	
	FillingValues = New Structure("EventType,FillBasis", 
		EventTypeByContactInformationType(DataCI.Type),
		FillBasis);
		
	FormParameters = New Structure("FillingValues", FillingValues);
	OpenForm("Document.Event.ObjectForm", FormParameters, Form);
	
EndProcedure

Procedure PresentationCIOnChange(Form, Item) Export
	
	IndexCI = Number(Mid(Item.Name, StrLen("PresentationCI_")+1));
	DataCI = Form.ContactInformation[IndexCI];
	
	If IsBlankString(DataCI.Presentation) Then
		DataCI.FieldValues = "";
	Else
		DataCI.FieldValues = ContactInformationSBServerCall.ContactInformationXMLByPresentation(DataCI.Presentation, DataCI.Kind);
	EndIf;
	
	//If DataCI.Type = PredefinedValue("Enum.ContactInformationTypes.Address") Then
	//	ContactInformationSBClientServer.FillChoiceListAddresses(Form);
	//EndIf;
	//
EndProcedure

Procedure PresentationCIStartChoice(Form, Item, ChoiceData, StandardProcessing, ClosingDialogNotify = Undefined) Export
	
	StandardProcessing = False;
	
	IndexCI = Number(Mid(Item.Name, StrLen("PresentationCI_")+1));
	DataCI = Form.ContactInformation[IndexCI];
	
	// If the presentation was changed in the field and does not match the attribute, then brought into conformity.
	If DataCI.Presentation <> Item.EditText Then
		DataCI.Presentation = Item.EditText;
		PresentationCIOnChange(Form, Item);
		Modified = True;
	EndIf;
	
	FormParameters = ContactInformationManagementClient.ContactInformationFormParameters(
						DataCI.Kind,
						DataCI.FieldValues,
						DataCI.Presentation,
						DataCI.Comment);
	
	AdditionalParameters = New Structure;
	AdditionalParameters.Insert("IndexCI", IndexCI);
	AdditionalParameters.Insert("Form", Form);
	
	If ClosingDialogNotify <> Undefined Then
		AdditionalParameters.Insert("ClosingDialogNotify", ClosingDialogNotify);
	EndIf;
	
	NotifyDescription = New NotifyDescription("ValueCIEditingInDialogEnd", ThisObject, AdditionalParameters);
	
	ContactInformationManagementClient.OpenContactInformationForm(FormParameters, ThisObject, , ,NotifyDescription);
	
EndProcedure

Procedure PresentationCIClearing(Form, Item, StandardProcessing) Export
	
	IndexCI = Number(Mid(Item.Name, StrLen("PresentationCI_")+1));
	DataCI = Form.ContactInformation[IndexCI];
	DataCI.FieldValues = "";
	
	//If DataCI.Type = PredefinedValue("Enum.ContactInformationTypes.Address") Then
	//	ContactInformationSBClientServer.FillChoiceListAddresses(Form);
	//EndIf;
	
EndProcedure

Procedure CommentCIOnChange(Form, Item) Export
	
	IndexCI = Number(Mid(Item.Name, StrLen("CommentCI_")+1));
	DataCI = Form.ContactInformation[IndexCI];
	
	ExpectedKind = ?(IsBlankString(DataCI.FieldValues), DataCI.Kind, Undefined);
	ContactInformationSBServerCall.SetContactInformationComment(DataCI.FieldValues, DataCI.Comment, ExpectedKind);
	
EndProcedure

Procedure ExecuteCommand(Form, Command) Export
	
	If Command.Name = "AddFieldContactInformation" Then
		
		AdditionalParameters = New Structure;
		AdditionalParameters.Insert("Form", Form);
		NotifyDescription = New NotifyDescription("AddContactInformationKindSelected", ThisObject, AdditionalParameters);
		
		ListAvailableKinds = ContactInformationSBClientServer.KindsListForAddingContactInformation(Form);
		
		Form.ShowChooseFromList(NotifyDescription, ListAvailableKinds, Form.Items[Command.Name]);
		
	ElsIf StrStartWith(Command.Name, "ContextMenuMapGoogle_") Then
		
		IndexCI = Number(Mid(Command.Name, StrLen("ContextMenuMapGoogle_")+1));
		DataCI = Form.ContactInformation[IndexCI];
		ContactInformationManagementClient.ShowAddressOnMap(DataCI.Presentation, "GoogleMaps");
		
	EndIf;
	
EndProcedure

#EndRegion

#Region Interface

// Function - Event type by contact information type
//
// Parameters:
//  TypeCI	 - EnumRef.ContactInformationTypes	 - type of contact information for which is determined by the type of event
// 
// Returned value:
//  EnumRef.EventTypes - appropriate the type of event
//
Function EventTypeByContactInformationType(TypeCI) Export 
	
	If TypeCI = PredefinedValue("Enum.ContactInformationTypes.Skype") Then
		EventType = PredefinedValue("Enum.EventTypes.Other");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.Address") Then
		EventType = PredefinedValue("Enum.EventTypes.PersonalMeeting");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.EmailAddress") Then
		EventType = PredefinedValue("Enum.EventTypes.Email");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.WebPage") Then
		EventType = PredefinedValue("Enum.EventTypes.Other");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.Other") Then
		EventType = PredefinedValue("Enum.EventTypes.Other");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.Phone") Then
		EventType = PredefinedValue("Enum.EventTypes.PhoneCall");
	ElsIf TypeCI = PredefinedValue("Enum.ContactInformationTypes.Fax") Then
		EventType = PredefinedValue("Enum.EventTypes.PhoneCall");
	Else
		EventType = PredefinedValue("Enum.EventTypes.EmptyRef");
	EndIf;
	
	Return EventType;
	
EndFunction

// Procedure - Call by Skype.
//
// Parameters:
//  LoginSkype		 - String	 - account name in Skype, with whom to contact
//  ActionInSkype	 - String	 - may take one of: "Call", "StartChat", "InfoAboutAccount"
//
Procedure CallBySkype(LoginSkype, ActionInSkype = "Call") Export
	
	#If Not WebClient Then
		If IsBlankString(TelephonySoftwareIsInstalled("skype")) Then
			ShowMessageBox(Undefined, NStr("ru = 'Для совершения звонка по Skype требуется установить программу.'; en = 'To make a call on Skype is required to install the program.'"));
			Return;
		EndIf;
	#EndIf
	
	LaunchString = "skype:" + LoginSkype;
	If ActionInSkype = "Call" Then
		LaunchString = LaunchString + "?call";
	ElsIf ActionInSkype = "StartChat" Then
		LaunchString = LaunchString + "?chat";
	Else
		LaunchString = LaunchString + "?userinfo";
	EndIf;
	
	Notify = New NotifyDescription("LaunchSkype", ThisObject, LaunchString);
	MessageText = NStr("ru = 'Для запуска Skype необходимо установить расширение работы с файлами.'; en = 'To start Skype, you must install the extension work with files.'");
	CommonUseClient.ShowFileSystemExtensionInstallationQuestion(Notify, MessageText);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

Procedure ValueCIEditingInDialogEnd(ClosingResult, AdditionalParameters) Export
	
	If TypeOf(ClosingResult) <> Type("Structure") Then
		Return;
	EndIf;
	
	DataCI = AdditionalParameters.Form.ContactInformation[AdditionalParameters.IndexCI];
	
	DataCI.Presentation	 = ClosingResult.Presentation;
	DataCI.FieldValues	 = ClosingResult.ContactInformation;
	DataCI.Comment		 = ClosingResult.Comment;
	
	AdditionalParameters.Form.Modified = True;
	
	//If DataCI.Type = PredefinedValue("Enum.ContactInformationTypes.Address") Then
	//	ContactInformationSBClientServer.FillChoiceListAddresses(AdditionalParameters.Form);
	//EndIf;
	//
	If AdditionalParameters.Property("ClosingDialogNotify") Then
		ExecuteNotifyProcessing(AdditionalParameters.ClosingDialogNotify, ClosingResult.Presentation);
	EndIf;
	
EndProcedure

Procedure AddContactInformationKindSelected(SelectedItem, AdditionalParameters) Export
	
	If SelectedItem = Undefined Then
		Return;
	EndIf;
	
	Form	= AdditionalParameters.Form;
	Filter	= New Structure("Kind", SelectedItem.Value);
	
	FindedRows = Form.ContactInformationKindProperties.FindRows(Filter);
	If FindedRows.Count() = 0 Then
		Return;
	EndIf;
	KindProperties = FindedRows[0];
	
	If KindProperties.ShowInFormAlways = False Then
		
		AdditionalParameters.Insert("AddingKind", SelectedItem.Value);
		NotifyDescription = New NotifyDescription("AddContactContactInformationQuestionAsked", ThisObject, AdditionalParameters);
		
		QuestionText = StrTemplate(NStr("ru='Добавить возможность ввода вида контактной информации ""%1""?'; en = 'Add the ability to input the type of contact information ""%1""?'"), SelectedItem.Value);
		QuestionTitle = NStr("ru='Подтверждение добавления'; en = 'Confirm adding'");
		
		ShowQueryBox(NotifyDescription, QuestionText, QuestionDialogMode.YesNo, , DialogReturnCode.Yes, QuestionTitle);
		
	Else
		
		Form.AddContactInformationServer(SelectedItem.Value);
		
	EndIf;
	
EndProcedure

Procedure AddContactContactInformationQuestionAsked(QuestionResult, AdditionalParameters) Export
	
	If QuestionResult <> DialogReturnCode.Yes Then
		Return;
	EndIf;
	
	AdditionalParameters.Form.AddContactInformationServer(AdditionalParameters.AddingKind, True);
	
EndProcedure

Procedure AfterSelectionFromMenuSkype(SelectedItem, Parameters) Export
	
	If SelectedItem = Undefined Then
		Return;
	EndIf;
	
	CallBySkype(Parameters.LoginSkype, SelectedItem.Value);
	
EndProcedure

Procedure LaunchSkype(ExtensionAttached, LaunchString) Export
	
	If ExtensionAttached Then
		Notify = New NotifyDescription("AfterLaunchApplication", ThisObject);
		BeginRunningApplication(Notify, LaunchString);
	EndIf;
	
EndProcedure

Procedure AfterLaunchApplication(SelectedItem, Parameters) Export
	// Stub procedure, because for BeginRunningApplication requires a notification handler.
EndProcedure

// Check whether the telephony software is installed on your computer.
//  Checking is only possible in a thin client for Windows.
//
// Parameters:
//  ProtocolName - String - Name verifiable URI protocol, options "skype", "tel", "sip".
//                          If not specified, then checked all the protocols. 
// 
// Returned value:
//  String - the name of the available URI protocol is registered in the registry. An empty string - if the protocol is not available.
//  Uncertain if the check is not possible.
//
Function TelephonySoftwareIsInstalled(ProtocolName = Undefined)
	
		If Not CommonUseClientServer.IsLinuxClient() Then
			If ValueIsFilled(ProtocolName) Then
				Return ?(ProtocolNameRegisteredInRegister(ProtocolName), ProtocolName, "");
			Else
				ProtocolList = New Array;
				ProtocolList.Add("tel");
				ProtocolList.Add("sip");
				ProtocolList.Add("skype");
				For Each ProtocolName In ProtocolList Do
					If ProtocolNameRegisteredInRegister(ProtocolName) Then
						Return ProtocolName;
					EndIf;
				EndDo;
				Return Undefined;
			EndIf;
		EndIf;
	
	Return "";
EndFunction

Function ProtocolNameRegisteredInRegister(ProtocolName)
	
	Try
		Shell = New COMObject("Wscript.Shell");
		Result = Shell.RegRead("HKEY_CLASSES_ROOT\" + ProtocolName + "\");
	Except
		Return False;
	EndTry;
	Return True;
EndFunction

#EndRegion
